A dry run of Terraform shows the next changes:
```
Terraform will perform the following actions:

  # module.auth0-deploy-ci-stage.aws_codebuild_webhook.webhook[0] will be created
  + resource "aws_codebuild_webhook" "webhook" {
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "auth0-deploy-stage"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "PUSH"
              + type                    = "EVENT"
            }
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "refs/heads/master"
              + type                    = "HEAD_REF"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```